## Understand data assessment and data cleaning process
This (fake) clinical trial dataset has three tables: patients, treatments, and adverse_reactions.

In [1]:
import numpy as np
import pandas as pd

In [2]:
patients = pd.read_csv('patients.csv')
treatments = pd.read_csv('treatments.csv')
adverse_reactions = pd.read_csv('adverse_reactions.csv')

### Visual Assessment

In [97]:
# Display the patients table
patients

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,951-719-9170ZoeWellish@superrito.com,7/10/1976,121.7,66,19.6
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,PamelaSHill@cuvox.de+1 (217) 569-3204,4/3/1967,118.8,66,19.2
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,402-363-6804JaeMDebord@gustr.com,2/19/1980,177.8,71,24.8
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,PhanBaLiem@jourrapide.com+1 (732) 636-8246,7/26/1951,220.9,70,31.7
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,334-515-7487TimNeudorf@cuvox.de,2/18/1928,192.3,27,26.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,499,male,Mustafa,Lindström,2530 Victoria Court,Milton Mills,ME,3852.0,United States,207-477-0579MustafaLindstrom@jourrapide.com,4/10/1959,181.1,72,24.6
499,500,male,Ruman,Bisliev,494 Clarksburg Park Road,Sedona,AZ,86341.0,United States,928-284-4492RumanBisliev@gustr.com,3/26/1948,239.6,70,34.4
500,501,female,Jinke,de Keizer,649 Nutter Street,Overland Park,MO,64110.0,United States,816-223-6007JinkedeKeizer@teleworm.us,1/13/1971,171.2,67,26.8
501,502,female,Chidalu,Onyekaozulu,3652 Boone Crockett Lane,Seattle,WA,98109.0,United States,ChidaluOnyekaozulu@jourrapide.com1 360 443 2060,2/13/1952,176.9,67,27.7
502,503,male,Pat,Gersten,2778 North Avenue,Burr,Nebraska,68324.0,United States,PatrickGersten@rhyta.com402-848-4923,5/3/1954,138.2,71,19.3

There, the column `bmi` is the Body Mass Index (BMI) of each patient. 

BMI is a simple calculation using a person's height and weight. The formula is `BMI = kg/m^2` where `kg` is a person's weight in kilograms and `m2` is their height in metres squared. A BMI of 25.0 or more is overweight, while the healthy range is **18.5** to **24.9**. 

The inclusion criteria for this clinical trial is 16 >= BMI >= 38.

The other columns need to note:
* weight: the weight of each patient in pounds (lbs)
* height: the height of each patient in inches (in)
* birthdate: the date of birth of each patient (month/day/year). The inclusion criteria for this clinical trial is age >= 18 (there is no maximum age because diabetes is a growing problem among the elderly population)
* assigned_sex: the assigned sex of each patient at birth (male or female)

In [98]:
treatments

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32
...,...,...,...,...,...,...,...
275,albina,zetticci,45u - 51u,-,7.93,7.73,0.20
276,john,teichelmann,-,49u - 49u,7.90,7.58,NaN
277,mathea,lillebø,23u - 36u,-,9.04,8.67,0.37
278,vallie,prince,31u - 38u,-,7.64,7.28,0.36
279,samúel,guðbrandsson,53u - 56u,-,8.00,7.64,0.36

350 patients participated in this clinical trial. None of the patients were using Novodra (a popular injectable insulin) or Auralin (the oral insulin being researched) as their primary source of insulin before. All were experiencing elevated HbA1c levels.

All 350 patients were treated with Novodra to establish a baseline HbA1c level and insulin dose. After four weeks, which isn’t enough time to capture all the change in HbA1c that can be attributed by the switch to Auralin or Novodra:

175 patients switched to Auralin for 24 weeks
175 patients continued using Novodra for 24 weeks

Some `treatments` columns:

* auralin: the baseline median daily dose of insulin from the week prior to switching to Auralin (the number before the dash) and the ending median daily dose of insulin at the end of the 24 weeks of treatment measured over the 24th week of treatment (the number after the dash). Both are measured in units (shortform 'u'), which is the international unit of measurement and the standard measurement for insulin.
* novodra: same as above, except for patients that continued treatment with Novodra
* hba1c_start: the patient's HbA1c level at the beginning of the first week of treatment. HbA1c stands for Hemoglobin A1c. The HbA1c test measures what the average blood sugar has been over the past three months. It is thus a powerful way to get an overall sense of how well diabetes has been controlled. Everyone with diabetes should have this test 2 to 4 times per year. Measured in %.
* hba1c_end: the patient's HbA1c level at the end of the last week of treatment
* hba1c_change: the change in the patient's HbA1c level from the start of treatment to the end, i.e., hba1c_start - hba1c_end. For Auralin to be deemed effective, it must be "noninferior" to Novodra, the current standard for insulin. This "noninferiority" is statistically defined as the upper bound of the 95% confidence interval being less than 0.4% for the difference between the mean HbA1c changes for Novodra and Auralin (i.e. Novodra minus Auralin).

In [99]:
adverse_reactions

     given_name     surname           adverse_reaction
0         berta  napolitani  injection site discomfort
1          lena        baer               hypoglycemia
2        joseph         day               hypoglycemia
3        flavia  fiorentino                      cough
4       manouck     wubbels          throat irritation
5       jasmine       sykes               hypoglycemia
6        louise     johnson               hypoglycemia
7       albinca     komavec               hypoglycemia
8           noe      aranda               hypoglycemia
9         sofia   hermansen  injection site discomfort
10        tegan     johnson                   headache
11         abel     yonatan                      cough
12    abdul-nur         isa               hypoglycemia
13         leon      scholz  injection site discomfort
14     gabriele     saenger               hypoglycemia
15       jia li        teng                     nausea
16        jakob    jakobsen               hypoglycemia
17  christopher    woodward                     nausea
18          ole    petersen               hypoglycemia
19       finley    chandler                   headache
20     anenechi       chidi               hypoglycemia
21     miłosław  wiśniewski  injection site discomfort
22        lixue       hsueh  injection site discomfort
23        merci      leroux               hypoglycemia
24         kang         mai  injection site discomfort
25       elliot  richardson               hypoglycemia
26      clinton      miller          throat irritation
27       idalia       moore               hypoglycemia
28       xiuxiu       chang               hypoglycemia
29         alex    crawford               hypoglycemia
30       monika      lončar               hypoglycemia
31       steven         roy                   headache
32      cecilie      nilsen               hypoglycemia
33    krisztina      magyar               hypoglycemia

Additional information:

* Insulin resistance varies person to person, which is why both starting median daily dose and ending median daily dose are required, i.e., to calculate change in dose.
* It is important to test drugs and medical products in the people they are meant to help. People of different age, race, sex, and ethnic group must be included in clinical trials. This diversity is reflected in the patients table.
* Ensuring column names are descriptive enough is an important step in acquainting yourself with the data. 'Descriptive enough' is subjective. Ideally you want short column names (so they are easier to type and read in code form) but also fully descriptive. Length vs. descriptiveness is a tradeoff and common debate (a similar debate exists for variable names). Like the auralin and novodra column names are probably not descriptive enough.

### Programmatic Assessment
This means using code to do anything other than looking through the data in its entirety. In pandas, this means using functions and methods to reveal data's quality and tidiness. 

There are lots of panda's functions and methods to be useful. A lof of assessing is driven by the problems you want to solve. We can check the values in the columns and rows that we plan usng in our analysis. Many times, non-directed programmatic assessment can also be useful. This is randonly typing in programmatic assessments without any directed goal in mind.

In [100]:
# .info() (DataFrame only)
patients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    object
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    object
 7   zip_code      491 non-null    float64
 8   country       491 non-null    object
 9   contact       491 non-null    object
 10  birthdate     503 non-null    object
 11  weight        503 non-null    float64
 12  height        503 non-null    int64
 13  bmi           503 non-null    float64
dtypes: float64(3), int64(2), object(9)
memory usage: 55.1+ KB

In [101]:
treatments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 280 entries, 0 to 279
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    280 non-null    object
 1   surname       280 non-null    object
 2   auralin       280 non-null    object
 3   novodra       280 non-null    object
 4   hba1c_start   280 non-null    float64
 5   hba1c_end     280 non-null    float64
 6   hba1c_change  171 non-null    float64
dtypes: float64(3), object(4)
memory usage: 15.4+ KB

In [3]:
#  sample() ( DataFrame and Series)
# Non-directed assessment using sample()
# Can give us a clue what we might need to clean
patients.sample(5)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
202,203,female,Jiřina,Šubrtová,4262 Heron Way,Portland,OR,97204.0,United States,JirinaSubrtova@rhyta.com503-820-7877,12/10/1987,138.4,61,26.1
485,486,male,Trifon,Izmailov,3697 Drainer Avenue,Fort Walton Beach,FL,32548.0,United States,TrifonIzmailov@fleckens.hu1 850 659 0417,2/15/1973,255.9,74,32.9
436,437,male,Sun,Ko,1962 Cabell Avenue,Washington,VA,20008.0,United States,703-547-0551SunKo@einrot.com,7/8/1969,154.4,72,20.9
74,75,female,Hanka,Gegič,192 Patton Lane,Tulsa,OK,74106.0,United States,918-975-7594HankaGegic@fleckens.hu,1/20/1926,103.2,61,19.5
410,411,male,Nathan,Cumpston,1203 Benson Park Drive,Wayne,OK,73095.0,United States,NathanCumpston@rhyta.com1 405 449 7960,10/6/1965,178.0,67,27.9

Some useful functions and methods good for programmatic assessment:
- .info()
- .sample()
- .head()
- .tail()
- .describe()
- .value_counts()
- .Various methods of indexing and selecting data (.loc and bracket notation with/without boolean indexing, also .iloc)
- .duplicated()
- .isnull()
- sum()
- .sort_values()

The following is some programmatic assessment examples.

In [103]:
patients.surname.value_counts()

Doe          6
Jakobsen     3
Taylor       3
Schiavone    2
Lâm          2
            ..
Quynh        1
Yudina       1
Ekwueme      1
Montagu      1
Ruais        1
Name: surname, Length: 466, dtype: int64

In [104]:
patients.address.value_counts()

123 Main Street             6
2778 North Avenue           2
2476 Fulton Street          2
648 Old Dear Lane           2
350 Ross Street             1
                           ..
4649 Worley Avenue          1
1619 Melm Street            1
4646 Highland View Drive    1
4148 Callison Lane          1
2945 Ferguson Street        1
Name: address, Length: 483, dtype: int64

In [105]:
# Check any duplicated records
patients[patients.address.duplicated()]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
29,30,male,Jake,Jakobsen,648 Old Dear Lane,Port Jervis,New York,12771.0,United States,JakobCJakobsen@einrot.com+1 (845) 858-7707,8/1/1985,155.8,67,24.4
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1
229,230,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
230,231,female,Elisabeth,Knudsen,NaN,NaN,NaN,NaN,NaN,NaN,9/23/1976,165.9,63,29.4
234,235,female,Martina,Tománková,NaN,NaN,NaN,NaN,NaN,NaN,4/7/1936,199.5,65,33.2
237,238,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
242,243,male,John,O'Brian,NaN,NaN,NaN,NaN,NaN,NaN,2/25/1957,205.3,74,26.4
244,245,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
249,250,male,Benjamin,Mehler,NaN,NaN,NaN,NaN,NaN,NaN,10/30/1951,146.5,69,21.6
251,252,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
257,258,male,Jin,Kung,NaN,NaN,NaN,NaN,NaN,NaN,5/17/1995,231.7,69,34.2
264,265,female,Wafiyyah,Asfour,NaN,NaN,NaN,NaN,NaN,NaN,11/3/1989,158.6,63,28.1
269,270,female,Flavia,Fiorentino,NaN,NaN,NaN,NaN,NaN,NaN,10/9/1937,175.2,61,33.1
277,278,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
278,279,female,Generosa,Cabán,NaN,NaN,NaN,NaN,NaN,NaN,12/16/1962,124.3,69,18.4
282,283,female,Sandy,Taylor,2476 Fulton Street,Rainelle,WV,25962.0,United States,304-438-2648SandraCTaylor@dayrep.com,10/23/1960,206.1,64,35.4
286,287,male,Lewis,Webb,NaN,NaN,NaN,NaN,NaN,NaN,4/1/1979,155.3,68,23.6
296,297,female,Chỉ,Lâm,NaN,NaN,NaN,NaN,NaN,NaN,5/14/1990,181.1,63,32.1
502,503,male,Pat,Gersten,2778 North Avenue,Burr,Nebraska,68324.0,United States,PatrickGersten@rhyta.com402-848-4923,5/3/1954,138.2,71,19.3

In [106]:
patients.weight.sort_values()

210     48.8
459    102.1
335    102.7
74     103.2
317    106.0
       ...
144    244.9
61     244.9
283    245.5
118    254.5
485    255.9
Name: weight, Length: 503, dtype: float64

In [107]:
# Verify Zaitseva's weight is surely in kg units
weight_lbs = patients[patients.surname == 'Zaitseva'].weight * 2.20462
height_in = patients[patients.surname == 'Zaitseva'].height
bmi_check = 703 * weight_lbs / (height_in * height_in)
bmi_check

210    19.055827
dtype: float64

In [108]:
# it matches the bmi metric
patients[patients.surname == 'Zaitseva'].bmi

210    19.1
Name: bmi, dtype: float64

In [109]:
sum(treatments.auralin.isnull())

0

In [110]:
sum(treatments.novodra.isnull())

0

In [111]:
# Find duplicated column names across the whole dataset
# Seek need to combine tables establish data tidiness
all_columns = pd.Series(list(patients) + list(treatments) + list(adverse_reactions))
all_columns[all_columns.duplicated()]

14    given_name
15       surname
21    given_name
22       surname
dtype: object

### The data quality issues
Data quality dimensions can help guide your thought while assessing. The four main data quality dimensions are:

- **Completeness**: do we have all of the records that we should? Do we have missing records or not? Are there specific rows, columns, or cells missing?
- **Validity**: we have the records, but they're not valid, i.e., they don't conform to a defined schema. A schema is a defined set of rules for data. These rules can be real-world constraints (e.g. negative height is impossible) and table-specific constraints (e.g. unique key constraints in tables).
- **Accuracy**: inaccurate data is wrong data that is valid. It adheres to the defined schema, but it is still incorrect. Example: a patient's weight that is 5 lbs too heavy because the scale was faulty.
- **Consistency**: inconsistent data is both valid and accurate, but there are multiple correct ways of referring to the same thing. Consistency, i.e., a standard format, in columns that represent the same data across tables and/or within tables is desired.

#### To follow the best practce of data wrangling, the data issues are to be documented so someone else can reproduce the result. We document here just above the Clean section

### The data tideness issues

The data is tidy if:
1. Every column is a variable
2. Every row is an observation
3. Every cell is a single value.

The five most common problems with messy datasets:
- Column headers are values, not variable names.
- Multiple variables are stored in one column.
- Variables are stored in both rows and columns.
- Multiple types of observational units are stored in the same table.
- A single observational unit is stored in multiple tables.

     *by Hadley Wickham*

For data issues that we found, we document here just above the Clean section.

#### Quality Issues

##### `patients` table
- zip code has four digits sometimes
- Tim Neudorf height is 27 in instead of 72 in (using bmi and weight to find the possible height typo)
- Full state names sometimes, abbreviations other times
- Dsvid Gustafsson in patient_id 9 wrong given name spelling
- Missing demographic information (address - contact columns)
- Erroneous datatypes (assigned sex, state, zip_code, and birthdate columns)
- Multiple phone number formats
- Duplicated default John Doe data
- Multiple records for Jakobsen, Gersten, Taylor
- Kgs instead of lbs for Zaitseva weight (verified by converting the value to lbs and calculated the bmi)


##### `treatments` table 
- missing hbA1c_changes values
- The letter u in starting and ending doses for Auralin and Novodra
- lowercase given names and surnames
- missing records (280 instead of 350)
- Erroneous datatypes (auralin and novodra columns)
- Inaccurate HbA1c changes (4s mistaken as 9s)
- Nulls represented as dashes (-) in auralin and novodra columns

##### `adverse_reactions` table
- lowercase given names and surnames

#### Tideness Issues
- contact column in `patients` table has two variables - a phone number and an email
- three variables in two columns, auralin and novodra, in treatments table (treatment, start dose, and end dose) since column headers are values (of a new column named `treatment`), not column names
- There should be only two observational unit (patients and treatments) in this dataset  other than 3 units (3 tables). This means adverse reaction should be part of the `treatments` table
- Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables

#### Up till now, we have done our first run assessment. Next, we are going to clean the data use the documented issues as our guidelines.

### Clean

We first address missing data, and next, tackle the tidiness issues, and finally clean up the quality issues. The very first thing to do before any cleaning occurs is to make a copy of each piece of data.
Programmatic data cleaning requires three steps: define, code, and test.
- Define: Convert assessments into how-to guide like pseudo code, also serve as documentation
- Code: Translate the pseudo code into code and run it
- Test: Verify the result is valid often using code

We need to re-visit the assessment part in this step, and restate each issue before each cleanning process.

We first deal with the most severe problem - the missing data, and we will make our data tidy, and finally we will clean up all data content problems.

In [4]:
# First of all, make a copy of data frames
patients_clean = patients.copy()
treatments_clean = treatments.copy()
adverse_reactions_clean = adverse_reactions.copy()

### Missing Data

#### `treatments`: Missing records (280 instead of 350)

###### Define

Import the cut treatments from the treatments_cut.csv file, and concatenate it with the treatments_clean DataFrame

###### Code

In [274]:
treatments_cut = pd.read_csv('treatments_cut.csv')

In [275]:
treatments_clean = pd.concat([treatments_clean, treatments_cut], ignore_index=True)

###### Test

In [115]:
treatments_clean.shape

(350, 7)

#### `treatments`: Missing HbA1c changes and Inaccurate HbA1c changes (leading 4s mistaken as 9s)

##### Define

Replace HbA1c changes with the recalculated value from subtracting hba1c_start to hba1c_end

##### Code

In [276]:
# Replace all the cells with the difference of hba1c_start and hba1c_end 
treatments_clean.hba1c_change = treatments_clean.hba1c_start - treatments_clean.hba1c_end

##### Test

In [117]:
treatments_clean.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,0.43
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.47
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,0.43
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32

### Tidiness

#### Contact column in `patients` table contains two variables: phone number and email

##### Define

Extract the email and the phone number from contact into two new columns (email and phone). Join the two new columns into patients_clean and then drop the contact column

##### Code

In [279]:
# Extract phone and email from the contact column
patients_clean['phone_number'] = patients.contact.str.extract(r'((?:\d{1,2}\s)?\(?\d{3}\)?[\s.-]?\d{3}[\s.-]?\d{4})', expand=True)
patients_clean['email'] = patients.contact.str.extract(r'(?P<email>[a-zA-Z]+[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z-.][a-zA-Z])')

In [280]:
# Drop the contact column
patients_clean.drop(columns='contact', inplace=True)

##### Test

In [285]:
# List the column labels
list(patients_clean)

['patient_id',
 'assigned_sex',
 'given_name',
 'surname',
 'address',
 'city',
 'state',
 'zip_code',
 'country',
 'birthdate',
 'weight',
 'height',
 'bmi',
 'phone_number',
 'email']

In [291]:
# Randomly sample the email column several times
patients_clean.email.sample(25)

487                    IvarLofgren@armyspy.co
386                  SargentFlamand@dayrep.co
297                 CsonkaBodor@jourrapide.co
477              JuliuszMajewski@superrito.co
187            WladyslawWieczorek@teleworm.us
491             VanessaFerguson@jourrapide.co
255                   MetteSandgreen@gustr.co
433                       LeoDVieira@cuvox.de
478    EdelmaVillalpandoSantillan@teleworm.us
162                  SarinaTabata@teleworm.us
85                 BurrellMathieu@teleworm.us
404                     AaliyahRice@dayrep.co
354                    VivianRHouse@dayrep.co
25                        GregorBole@gustr.co
259                       SaraDMiles@gustr.co
122                      TaHaBoi@superrito.co
435                    IvanaKasna@teleworm.us
421                     ArminaSauve@dayrep.co
216              GabrielleBidwill@teleworm.us
320                    NoriyukiSakai@gustr.co
26                        EllaLund@armyspy.co
242                                       NaN
395                BakosKrisztian@teleworm.us
87               MagomedKadyrov@jourrapide.co
215                          johndoe@email.co
Name: email, dtype: object

In [292]:
# Randomly sample the phone_number column several times too
patients_clean.phone_number.sample(25)

484        336-697-2005
22         914-745-6108
351        423-799-1730
325      1 312 856 6826
365        540-986-1369
411      1 518 487 4865
315    1 (830) 851-4280
147        310-268-6864
440    1 (573) 493-4748
76         612-925-3123
498        207-477-0579
169        302-474-8075
140        217-421-0935
389        918-459-9811
308        631-875-3023
267    1 (785) 823-6728
112    1 (757) 885-5669
382        989-822-1351
356    1 (225) 695-5230
36         715-562-7013
376    1 (501) 636-4058
300        706-616-0152
40       1 404 547 4508
5          386-334-5237
137        954-784-6658
Name: phone_number, dtype: object

In [294]:
# Confirm that no emails start with an integer
patients_clean.email.sort_values().head()

404               AaliyahRice@dayrep.co
11          Abdul-NurMummarIsa@rhyta.co
332               AbelEfrem@fleckens.hu
258             AbelYonatan@teleworm.us
305    AddolorataLombardi@jourrapide.co
Name: email, dtype: object

#### Three variables in two columns in `treatments` table (treatment, start dose and end dose)

##### Define

Unpivot the DataFrame into a treatment and a dose column from auralin and novodra columns. Then split the dose column on '-' to obtain start_dose and end_dose columns. Drop the intermediate dose column.

##### Code

In [295]:
# Melt the auralin and novodra columns to a treatment column and a dose column
treatments_clean = pd.melt(treatments_clean, 
                           id_vars=['given_name', 'surname', 'hba1c_start', 'hba1c_end', 'hba1c_change'], 
                           var_name='treatment', value_name='dose')

In [296]:
# Extract the rows with dose values
treatments_clean = treatments_clean[treatments_clean.dose != "-"]

In [297]:
treatments_clean.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u - 48u
3,skye,gormanston,7.97,7.62,0.35,auralin,33u - 36u
6,sophia,haugen,7.65,7.27,0.38,auralin,37u - 42u
7,eddie,archer,7.89,7.55,0.34,auralin,31u - 38u
9,asia,woźniak,7.76,7.37,0.39,auralin,30u - 36u

In [315]:
# Split the dose information into a start_dose column and a end_dose column
treatments_clean['start_dose'], treatments_clean['end_dose'] = treatments_clean.dose.str.split(' - ').str

<ipython-input-315-d917646e9e19>:2: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  treatments_clean['start_dose'], treatments_clean['end_dose'] = treatments_clean.dose.str.split(' - ', 1).str

In [317]:
# Drop the dose column
treatments_clean.drop(columns='dose', inplace=True)

In [318]:
# Reset the index
treatments_clean.reset_index(drop=True)

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u
1,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u
2,sophia,haugen,7.65,7.27,0.38,auralin,37u,42u
3,eddie,archer,7.89,7.55,0.34,auralin,31u,38u
4,asia,woźniak,7.76,7.37,0.39,auralin,30u,36u
...,...,...,...,...,...,...,...,...
345,christopher,woodward,7.51,7.06,0.45,novodra,55u,51u
346,maret,sultygov,7.67,7.30,0.37,novodra,26u,23u
347,lixue,hsueh,9.21,8.80,0.41,novodra,22u,23u
348,jakob,jakobsen,7.96,7.51,0.45,novodra,28u,26u
349,berta,napolitani,7.68,7.21,0.47,novodra,42u,44u

##### Test

In [140]:
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 350 entries, 0 to 698
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    350 non-null    object
 1   surname       350 non-null    object
 2   hba1c_start   350 non-null    float64
 3   hba1c_end     350 non-null    float64
 4   hba1c_change  350 non-null    float64
 5   treatment     350 non-null    object
 6   start_dose    350 non-null    int32
 7   end_dose      350 non-null    int32
dtypes: float64(3), int32(2), object(3)
memory usage: 30.0+ KB

In [319]:
# Take a sample from the original DataFrame
treatments.sample()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
217,taylah,mobourne,41u - 50u,-,7.9,7.51,0.39

In [320]:
# To compare, query the same record from treatments_clean
treatments_clean.query('given_name == "taylah"')

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose
217,taylah,mobourne,7.9,7.51,0.39,auralin,41u,50u

#### Adverse reaction should be part of the treatments table

##### Define

Merge both tables on given_name and surname and use outer join

##### Code

In [321]:
# Outer join the treatments_clean column and the adverse_reactions_clean column on ['given_name', 'surname'] columns
treatments_clean = treatments_clean.merge(adverse_reactions_clean, on=['given_name', 'surname'], how='outer')

##### Test

In [322]:
treatments_clean

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose,adverse_reaction
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u,NaN
1,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u,NaN
2,sophia,haugen,7.65,7.27,0.38,auralin,37u,42u,NaN
3,eddie,archer,7.89,7.55,0.34,auralin,31u,38u,NaN
4,asia,woźniak,7.76,7.37,0.39,auralin,30u,36u,NaN
...,...,...,...,...,...,...,...,...,...
345,christopher,woodward,7.51,7.06,0.45,novodra,55u,51u,nausea
346,maret,sultygov,7.67,7.30,0.37,novodra,26u,23u,NaN
347,lixue,hsueh,9.21,8.80,0.41,novodra,22u,23u,injection site discomfort
348,jakob,jakobsen,7.96,7.51,0.45,novodra,28u,26u,hypoglycemia
349,berta,napolitani,7.68,7.21,0.47,novodra,42u,44u,injection site discomfort

In [145]:
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 350 entries, 0 to 349
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   given_name        350 non-null    object
 1   surname           350 non-null    object
 2   hba1c_start       350 non-null    float64
 3   hba1c_end         350 non-null    float64
 4   hba1c_change      350 non-null    float64
 5   treatment         350 non-null    object
 6   start_dose        350 non-null    int32
 7   end_dose          350 non-null    int32
 8   adverse_reaction  35 non-null     object
dtypes: float64(3), int32(2), object(4)
memory usage: 24.6+ KB

#### Dsvid Gustafsson. Given name and surname columns in patients table duplicated in treatments and adverse_reactions tables and Lowercase given names and surnames

##### Define

- Adverse reactions table is no longer deeded so ignore that part. 
- Replace Dsvid in given_name to David. 
- Capitalize the first character in given_name and surname from the table treatment. And remove the space for surname and given_name in both patients and treatments tables. 
- Inner join the patient_id (from patient table) into the treatment table, 
- Drop treatment_clean's surname and given_name

##### Code

In [146]:
# Look up where the record is
patients_clean.query('given_name == "Dsvid"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
8,9,male,Dsvid,Gustafsson,1790 Nutter Street,Kansas City,MO,64105.0,United States,3/6/1937,163.9,66,26.5,816-265-9578,DavidGustafsson@armyspy.com

In [323]:
# Replace the cell with a correct name
patients_clean.given_name.replace({'Dsvid': 'David'}, inplace=True)

In [324]:
# Strip the space and capitalize the first character
treatments_clean['surname'] = treatments_clean.surname.str.strip().str.title()
treatments_clean['given_name'] = treatments_clean.given_name.str.title().str.strip()
patients_clean['surname'] = patients_clean.surname.str.title().str.strip()
patients_clean['given_name'] = patients_clean.given_name.str.title().str.strip()

In [325]:
# Perform the inner join 
treatments_clean = pd.merge(treatments_clean, patients_clean[['given_name', 'surname', 'patient_id']])

In [328]:
treatments_clean.drop(columns=['given_name', 'surname'], inplace=True)

##### Test

In [156]:
# No missing values in patient_id
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 350 entries, 0 to 349
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   hba1c_start       350 non-null    float64
 1   hba1c_end         350 non-null    float64
 2   hba1c_change      350 non-null    float64
 3   treatment         350 non-null    object
 4   start_dose        350 non-null    int32
 5   end_dose          350 non-null    int32
 6   adverse_reaction  35 non-null     object
 7   patient_id        350 non-null    int64
dtypes: float64(3), int32(2), int64(1), object(2)
memory usage: 21.9+ KB

In [326]:
treatments_clean

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose,adverse_reaction,patient_id
0,Veronika,Jindrová,7.63,7.20,0.43,auralin,41u,48u,NaN,225
1,Skye,Gormanston,7.97,7.62,0.35,auralin,33u,36u,NaN,242
2,Sophia,Haugen,7.65,7.27,0.38,auralin,37u,42u,NaN,345
3,Eddie,Archer,7.89,7.55,0.34,auralin,31u,38u,NaN,276
4,Asia,Woźniak,7.76,7.37,0.39,auralin,30u,36u,NaN,15
...,...,...,...,...,...,...,...,...,...,...
345,Christopher,Woodward,7.51,7.06,0.45,novodra,55u,51u,nausea,153
346,Maret,Sultygov,7.67,7.30,0.37,novodra,26u,23u,NaN,420
347,Lixue,Hsueh,9.21,8.80,0.41,novodra,22u,23u,injection site discomfort,336
348,Jakob,Jakobsen,7.96,7.51,0.45,novodra,28u,26u,hypoglycemia,25
349,Berta,Napolitani,7.68,7.21,0.47,novodra,42u,44u,injection site discomfort,477

In [331]:
# And patient ID should be the only duplicate column
all_columns = pd.Series(list(patients_clean) + list(treatments_clean))
all_columns[all_columns.duplicated()]

22    patient_id
dtype: object

### Quality

#### Zip code is a float not a string and Zip code has four digits sometimes

##### Define

- Convert the floating point type to the string type using astype
- Remove '.0' using string slicing
- Fill or pad 0 four digit zip codes with a leading 0

##### Code

In [343]:
# Change the data type, slide the string and pad the 0s
patients_clean.zip_code = patients_clean.zip_code.astype('str').str[:-2].str.zfill(5)

##### Test

In [345]:
patients_clean.zip_code.value_counts()

0000n    12
12345     6
30303     4
10004     4
15205     3
         ..
31401     1
19020     1
31901     1
30902     1
99701     1
Name: zip_code, Length: 431, dtype: int64

In [348]:
# Reconvert NaNs entries that were converted to '0000n' by code above
patients_clean.zip_code = patients_clean.zip_code.replace('0000n', np.nan)

In [349]:
# find extra issues, this require additional attention
patients_clean.zip_code.value_counts()

12345    6
30303    4
10004    4
15205    3
90017    3
        ..
19020    1
31901    1
30902    1
90025    1
99701    1
Name: zip_code, Length: 430, dtype: int64

In [354]:
# Sample the data several times
patients_clean.zip_code.sample(45)

301    10004
479    91762
34     04474
156    55113
310    66219
120    94108
338    70001
334    60103
346    13904
77     40507
489    94549
158    74136
387    33301
259    33610
175    62650
400    53073
43     82939
144    46804
170    11227
484    28716
52     50322
149    78058
344    30303
335    47933
38     01581
116    41601
471    97205
248    68859
380    08232
9      10011
354    07102
246    92704
0      92390
355    02905
57     91941
41     56230
1      61812
326    12303
36     54701
269      NaN
253    32810
93     33323
219      NaN
85     34746
432    77020
Name: zip_code, dtype: object

#### Tim Neudorf height is 27 in instead of 72 in

##### Define

Change Tim Neudorf's height from 27 to 72

##### Code

In [161]:
# Query this record
patients.query('height == 27')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,334-515-7487TimNeudorf@cuvox.de,2/18/1928,192.3,27,26.1

In [356]:
# Replace this cell
patients_clean.at[4, 'height'] = 72

##### Test

In [357]:
# This should return empty records
patients_clean[patients_clean.height == 27]

Empty DataFrame
Columns: [patient_id, assigned_sex, given_name, surname, address, city, state, zip_code, country, birthdate, weight, height, bmi, phone_number, email]
Index: []

In [359]:
# Confirm the replacement is working
patients_clean[patients_clean.surname == 'Neudorf']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone_number,email
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303,United States,2/18/1928,192.3,72,26.1,334-515-7487,TimNeudorf@cuvox.de

#### Full state names sometimes, abbreviations other times

##### Define

- Find out how many states are in full names
- Create a dictionary for the mapping
- Create a function to find the full name, and return the abbreviated name
- Apply the function to each state in the state column and replace it if necessary

##### Code

In [164]:
# Find out what states are not in abbreviated form
patients_clean.state[patients_clean.state.str.len() > 2].value_counts()

California    36
New York      25
Illinois      14
Florida       13
Nebraska       4
Name: state, dtype: int64

In [360]:
# Mapping from full state name to abbreviation
state_abbrev = {'California': 'CA',
                'New York': 'NY',
                'Illinois': 'IL',
                'Florida': 'FL',
                'Nebraska': 'NE'}

In [361]:
# Function to apply
def abbreviate_state(state):
    if state in state_abbrev.keys():
        return state_abbrev[state]
    else:
        return state

In [362]:
# Use apply function for each element of column state
patients_clean['state'] = patients_clean.state.apply(abbreviate_state)

##### Test

In [365]:
# Should return zero
patients_clean.state[patients_clean.state.str.len() > 2].sum()

0

In [366]:
# Skim through the states
patients_clean.state.value_counts()

CA    60
NY    47
TX    32
IL    24
FL    22
MA    22
PA    18
GA    15
OH    14
MI    13
OK    13
LA    13
NJ    12
VA    11
WI    10
MS    10
IN     9
TN     9
AL     9
MN     9
KY     8
NC     8
WA     8
MO     7
KS     6
NV     6
ID     6
NE     6
SC     5
IA     5
CT     5
RI     4
CO     4
AZ     4
AR     4
ND     4
ME     4
SD     3
OR     3
MD     3
WV     3
DE     3
VT     2
DC     2
MT     2
WY     1
AK     1
NH     1
NM     1
Name: state, dtype: int64

#### Erroneous datatypes (assigned sex, state, zip_code, and birthdate columns) and Erroneous datatypes (auralin and novodra columns) and The letter 'u' in starting and ending doses for Auralin and Novodra

##### Define

Convert assigned sex and state to categorical data types. Zip code data type was already addressed above. Convert birthdate to datetime data type. Strip the letter 'u' in start dose and end dose and convert those columns to data type integer.

##### Code

In [367]:
patients_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    object
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    object
 7   zip_code      491 non-null    object
 8   country       491 non-null    object
 9   birthdate     503 non-null    object
 10  weight        503 non-null    float64
 11  height        503 non-null    int64
 12  bmi           503 non-null    float64
 13  phone_number  491 non-null    object
 14  email         491 non-null    object
dtypes: float64(2), int64(2), object(11)
memory usage: 59.1+ KB

In [368]:
# Convert assigned sex and state to categorical data types
patients_clean.assigned_sex = patients_clean.assigned_sex.astype('category')
patients_clean.state = patients_clean.state.astype('category')

In [371]:
# Convert birthdate to datetime data type
patients_clean.birthdate = pd.to_datetime(patients_clean.birthdate)

In [378]:
# # Strip u and convert its type to integer
treatments_clean.start_dose = treatments_clean.start_dose.str.strip('u').astype(int)
treatments_clean.end_dose = treatments_clean.end_dose.str.strip('u').astype(int)

##### Test

In [379]:
# The datatype should have been changed
patients_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    category
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    category
 7   zip_code      491 non-null    object
 8   country       491 non-null    object
 9   birthdate     503 non-null    datetime64[ns]
 10  weight        503 non-null    float64
 11  height        503 non-null    int64
 12  bmi           503 non-null    float64
 13  phone_number  491 non-null    object
 14  email         491 non-null    object
dtypes: category(2), datetime64[ns](1), float64(2), int64(2), object(8)
memory usage: 53.7+ KB

In [381]:
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 350 entries, 0 to 349
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   hba1c_start       350 non-null    float64
 1   hba1c_end         350 non-null    float64
 2   hba1c_change      350 non-null    float64
 3   treatment         350 non-null    object
 4   start_dose        350 non-null    int32
 5   end_dose          350 non-null    int32
 6   adverse_reaction  35 non-null     object
 7   patient_id        350 non-null    int64
dtypes: float64(3), int32(2), int64(1), object(2)
memory usage: 21.9+ KB

In [382]:
treatments_clean.head()

,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose,adverse_reaction,patient_id
0,7.63,7.20,0.43,auralin,41,48,NaN,225
1,7.97,7.62,0.35,auralin,33,36,NaN,242
2,7.65,7.27,0.38,auralin,37,42,NaN,345
3,7.89,7.55,0.34,auralin,31,38,NaN,276
4,7.76,7.37,0.39,auralin,30,36,NaN,15

#### Multiple phone number formats

##### Define

Option 1: Extract only the 10 digit phone number (without country code) and replace and closing parenthesis with '-', and replace the opening parenthesis with an empty string

Option 2: Strip all " ", "-", "(", ")", and "+" and store each number without any formatting. Pad the phone number with a 1 if the length of the number is 10 digits (we want country code).

##### Code

In [386]:
# First option: use regular expression to extract the phone number
patients_clean.phone_number = patients_clean.phone_number.str.extract(
    r'((?:(?:(\s*\(?([2-9]1[02-9]|[2-9][02-8]1|[2-9][02-8][02-9])\s*)|([2-9]1[02-9]|[2-9][02-8]1|[2-9][02-8][02-9]))\)?\s*(?:[.-]\s*)?)([2-9]1[02-9]|[2-9][02-9]1|[2-9][02-9]{2})\s*(?:[.-]\s*)?([0-9]{4}))'
    )[0].str.strip().replace({r'(\()':'', r'(\)\s)':'-'}, regex=True)

In [387]:
patients_clean.phone_number

0      951-719-9170
1      217-569-3204
2      402-363-6804
3      732-636-8246
4      334-515-7487
           ...
498    207-477-0579
499    928-284-4492
500    816-223-6007
501    360 443 2060
502    402-848-4923
Name: phone_number, Length: 503, dtype: object

In [392]:
phone.sample(10)

299    208-826-1678
32     562-985-4582
28     267 895 7462
143    206-902-0473
89     480-967-6336
26     309-671-8852
386    408-215-6012
185    989 375 2216
482    361-693-4960
207    989-936-4563
Name: 0, dtype: object

In [399]:
# Second option: Store phone number without any formatting
# Replace non-numeric number with '' , and pad 1 into 10-digit phone numbers

patients_clean.phone_number = patients_clean.phone_number.str.replace(r'\D+', '').str.pad(11, fillchar='1')

<ipython-input-399-e32a807f8355>:4: FutureWarning: The default value of regex will change from True to False in a future version.
  patients_clean.phone_number = patients_clean.phone_number.str.replace(r'\D+', '').str.pad(11, fillchar='1')

##### Test

In [400]:
patients_clean.phone_number.sample(10)

462    12137496958
48     13127197238
104    16022657408
236    13033603627
181    19707545843
289    15044417744
156    16122082965
203    16364426946
401    17857488181
129    16313707406
Name: phone_number, dtype: object

#### Default John Doe data

##### Define

Remove the non-recoverable John Doe records from the `patients` table

##### Code

In [404]:
# Just extract the non-recoverable records
patients_clean = patients_clean[patients_clean.surname != 'Doe']

##### Test

In [405]:
# No more John Does
patients_clean.surname.value_counts()

Jakobsen     3
Taylor       3
Schiavone    2
Johnson      2
Dratchev     2
            ..
Mata         1
Dimmen       1
Ouwendijk    1
Quynh        1
Mckay        1
Name: surname, Length: 465, dtype: int64

In [406]:
# Should be also no 123 Main Street records
patients_clean.address.value_counts()

2778 North Avenue           2
648 Old Dear Lane           2
2476 Fulton Street          2
350 Ross Street             1
2636 Benson Park Drive      1
                           ..
1619 Melm Street            1
4646 Highland View Drive    1
4148 Callison Lane          1
456 Delaware Avenue         1
2945 Ferguson Street        1
Name: address, Length: 482, dtype: int64

#### Multiple records for Jakobsen, Gersten, Taylor

##### Define

Remove the Jake Jakobsen, Pat Gersten, and Sandy Taylor rows from the patients table. These are the nicknames, which happen to also not be in the treatments table (removing the wrong name would create a consistency issue between the patients and treatments table). These are all the second occurrence of the duplicate. These are also the only occurences of non-null duplicate addresses.

##### Code

Method 1: Find each duplicate and drop it

In [255]:
patients_clean.query('surname == "Taylor"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
131,132,female,Sandra,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,10/23/1960,206.1,64,35.4,304-438-2648,SandraCTaylor@dayrep.com
282,283,female,Sandy,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,10/23/1960,206.1,64,35.4,304-438-2648,SandraCTaylor@dayrep.com
426,427,male,Rogelio,Taylor,4064 Marigold Lane,Miami,FL,33179,United States,9/2/1992,186.6,69,27.6,305-434-6299,RogelioJTaylor@teleworm.us

In [257]:
patients_clean.drop(index=282, inplace=True)

In [259]:
patients_clean.query('surname == "Gersten"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
97,98,male,Patrick,Gersten,2778 North Avenue,Burr,NE,68324,United States,5/3/1954,138.2,71,19.3,402-848-4923,PatrickGersten@rhyta.com
502,503,male,Pat,Gersten,2778 North Avenue,Burr,NE,68324,United States,5/3/1954,138.2,71,19.3,402-848-4923,PatrickGersten@rhyta.com

In [260]:
patients_clean.drop(index=502, inplace=True)

In [261]:
patients_clean.query('surname == "Jakobsen"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
24,25,male,Jakob,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,8/1/1985,155.8,67,24.4,845-858-7707,JakobCJakobsen@einrot.com
29,30,male,Jake,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,8/1/1985,155.8,67,24.4,845-858-7707,JakobCJakobsen@einrot.com
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,77020,United States,11/25/1962,185.2,67,29.0,979 203 0438,KarenJakobsen@jourrapide.com

In [262]:
patients_clean.drop(index=29, inplace=True)

Method 2: Negate the duplicated records and extract non-duplicated records

In [410]:
patients_clean = patients_clean[~(patients_clean.address.duplicated() & patients_clean.address.notnull())]

##### Test

In [263]:
patients_clean.query('surname == "Taylor"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
131,132,female,Sandra,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,10/23/1960,206.1,64,35.4,304-438-2648,SandraCTaylor@dayrep.com
426,427,male,Rogelio,Taylor,4064 Marigold Lane,Miami,FL,33179,United States,9/2/1992,186.6,69,27.6,305-434-6299,RogelioJTaylor@teleworm.us

In [264]:
patients_clean.query('surname == "Gersten"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
97,98,male,Patrick,Gersten,2778 North Avenue,Burr,NE,68324,United States,5/3/1954,138.2,71,19.3,402-848-4923,PatrickGersten@rhyta.com

In [265]:
patients_clean.query('surname == "Jakobsen"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
24,25,male,Jakob,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,8/1/1985,155.8,67,24.4,845-858-7707,JakobCJakobsen@einrot.com
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,77020,United States,11/25/1962,185.2,67,29.0,979 203 0438,KarenJakobsen@jourrapide.com

#### kgs instead of lbs for Zaitseva weight

##### Define

Replace the cell with the value of kgs to the value of lbs

##### Code

In [267]:
patients_clean.query('surname == "Zaitseva"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone,email
210,211,female,Camilla,Zaitseva,4689 Briarhill Lane,Wooster,OH,44691,United States,11/26/1938,48.8,63,19.1,330-202-2145,CamillaZaitseva@superrito.com

In [417]:
# use .at to locate the cell and replace the value
patients_clean.at[210, 'weight'] = 107.58

##### Test

In [414]:
# Use query()
patients_clean.query('surname == "Zaitseva"')

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone_number,email,phone
210,211,female,Camilla,Zaitseva,4689 Briarhill Lane,Wooster,OH,44691,United States,1938-11-26,107.58,63,19.1,13302022145,CamillaZaitseva@superrito.co,330-202-2145

In [416]:
# Or use sort_values()
patients_clean.weight.sort_values()

459    102.1
335    102.7
74     103.2
317    106.0
171    106.5
       ...
144    244.9
61     244.9
283    245.5
118    254.5
485    255.9
Name: weight, Length: 494, dtype: float64